12/data/attachments/3a7b85811f2f3558.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_25bbe40f-2178-4dd0-a834-437ebfbe2f6e</nif:username>
            <nif:friendToBeAdded>Michelle_audience_Actions_33903_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>